OpenPuya/IAP_APP_Fireware/PY32F4xx_IAP_APP_Firmware/Drivers/PY32F4xx_HAL_Driver/Inc/py32f4xx_ll_sdio.h
/** @defgroup SDIO_LL_Power_State Power state.
  * @{
  */
#define SDIO_POWER_STATE_OFF           ((uint32_t)0x00000000U)
#define SDIO_POWER_STATE_ON            SDIO_POWER_PWRCTRL
/**
  * @}
  */

/** @defgroup SDIO_LL_SMP_Clock Select a pre-sampled clock source.
  * @{
  */
#define SDIO_SMP_CLOCK_SDCLK_OFFSET270          ((uint32_t)0x00000000U)
#define SDIO_SMP_CLOCK_SDCLK_DEFAULT            SDIO_CLKCR_SMPCLKSEL
/**
  * @}
  */

/** @defgroup SDIO_LL_SMP_State Set Pre-Sampling Status.
  * @{
  */
#define SDIO_SMP_DISABLE                        ((uint32_t)0x00000000U)
#define SDIO_SMP_ENABLE                         SDIO_CLKCR_SMPEN
/**
  * @}
  */

/** @defgroup SDIO_LL_Clock_Output Select SDIO Output Clock.
  * @{
  */
#define SDIO_CLOCK_OUTPUT_OFFSET90              ((uint32_t)0x00000000U)
#define SDIO_CLOCK_OUTPUT_OFFSET180             SDIO_CLKCR_CKSEL
/**
  * @}
  */

/** @defgroup SDIO_LL_Response_Type Set Response Length.
  * @{
  */
#define SDIO_RESPONSE_NO                      ((uint32_t)0x00000000)
#define SDIO_RESPONSE_SHORT                   SDIO_CMD_WAITRESP
#define SDIO_RESPONSE_LONG                    (SDIO_CMD_WAITRESP| SDIO_CMD_RESPLEN)
/**
  * @}
  */

/** @defgroup SDIO_LL_Wait_Transfer_State CPSM Waits for Data Transfer to End.
  * @{
  */
#define SDIO_WAIT_NO                     ((uint32_t)0x00000000)
#define SDIO_WAIT_PEND                   SDIO_CMD_WAITPEND
/**
  * @}
  */

/** @defgroup SDIO_LL_Initsignal Whether to send initialization sequence.
  * @{
  */
#define SDIO_INITSIGNAL_DISABLE          ((uint32_t)0x00000000) 
#define SDIO_INITSIGNAL_ENABLE           SDIO_CMD_AUTOINIT
/**
  * @}
  */
  
/** @defgroup SDIO_LL_Response_CRC Check response CRC.
  * @{
  */
#define SDIO_RESPONSE_CRC_DISABLE        ((uint32_t)0x00000000) 
#define SDIO_RESPONSE_CRC_ENABLE         SDIO_CMD_CHECKRESPCRC
/**
  * @}
  */
  
/** @defgroup SDIO_LL_DataTransfer Expected data transfer
  * @{
  */
#define SDIO_DATATRANSFER_DISABLE             ((uint32_t)0x00000000) 
#define SDIO_DATATRANSFER_ENABLE              SDIO_CMD_DEXPECT
/**
  * @}
  */
  
/** @defgroup SDIO_LL_CPSM_State CPSM State
  * @{
  */
#define SDIO_CPSM_DISABLE                     ((uint32_t)0x00000000)
#define SDIO_CPSM_ENABLE                      SDIO_CMD_STARTCMD
/**
  * @}
  */
  

/** @defgroup SDIO_LL_Data_Block_Size Data Block Size
  * @{
  */
#define SDIO_DATABLOCKSIZE_1B               ((uint32_t)0x00000001)
#define SDIO_DATABLOCKSIZE_2B               ((uint32_t)0x00000002)
#define SDIO_DATABLOCKSIZE_4B               ((uint32_t)0x00000004)
#define SDIO_DATABLOCKSIZE_8B               ((uint32_t)0x00000008)
#define SDIO_DATABLOCKSIZE_16B              ((uint32_t)0x00000010)
#define SDIO_DATABLOCKSIZE_32B              ((uint32_t)0x00000020)
#define SDIO_DATABLOCKSIZE_64B              ((uint32_t)0x00000040)
#define SDIO_DATABLOCKSIZE_128B             ((uint32_t)0x00000080)
#define SDIO_DATABLOCKSIZE_256B             ((uint32_t)0x00000100)
#define SDIO_DATABLOCKSIZE_512B             ((uint32_t)0x00000200)
#define SDIO_DATABLOCKSIZE_1024B            ((uint32_t)0x00000400)
#define SDIO_DATABLOCKSIZE_2048B            ((uint32_t)0x00000800)
#define SDIO_DATABLOCKSIZE_4096B            ((uint32_t)0x00001000)
#define SDIO_DATABLOCKSIZE_8192B            ((uint32_t)0x00002000)
#define SDIO_DATABLOCKSIZE_16384B           ((uint32_t)0x00004000)
/**
  * @}
  */

/** @defgroup SDIO_LL_Transfer_Direction Transfer Direction
  * @{
  */
#define SDIO_TRANSFERDIR_TO_SDIO            ((uint32_t)0x00000000)
#define SDIO_TRANSFERDIR_TO_CARD            SDIO_CMD_DIR
/**
  * @}
  */

/** @defgroup SDIO_LL_Transfer_Type Transfer Type
  * @{
  */
#define SDIO_TRANSFERMODE_BLOCK             ((uint32_t)0x00000000)
#define SDIO_TRANSFERMODE_STREAM            SDIO_CMD_DTMODE
/**
  * @}
  */

/** @defgroup FIFO Threshold
  * @{
  */
#define SDIO_FIFO_WMARK_1                    ((uint32_t)0x00000001)
#define SDIO_FIFO_WMARK_2                    ((uint32_t)0x00000002)
#define SDIO_FIFO_WMARK_3                    ((uint32_t)0x00000003)
#define SDIO_FIFO_WMARK_4                    ((uint32_t)0x00000004)
#define SDIO_FIFO_WMARK_5                    ((uint32_t)0x00000005)
#define SDIO_FIFO_WMARK_6                    ((uint32_t)0x00000006)
#define SDIO_FIFO_WMARK_7                    ((uint32_t)0x00000007)
#define SDIO_FIFO_WMARK_8                    ((uint32_t)0x00000008)
#define SDIO_FIFO_WMARK_9                    ((uint32_t)0x00000009)
#define SDIO_FIFO_WMARK_10                   ((uint32_t)0x00000010)
#define SDIO_FIFO_WMARK_11                   ((uint32_t)0x00000011)
#define SDIO_FIFO_WMARK_12                   ((uint32_t)0x00000012)
#define SDIO_FIFO_WMARK_13                   ((uint32_t)0x00000013)
#define SDIO_FIFO_WMARK_14                   ((uint32_t)0x00000014)
#define SDIO_FIFO_WMARK_15                   ((uint32_t)0x00000015)
#define SDIO_FIFO_WMARK_16                   ((uint32_t)0x00000016)
/**
  * @}
  */

/** @defgroup Interrupt pending
  * @{
  */
#define SDIO_IT_CD                           ((uint32_t)0x00000001)
#define SDIO_IT_RE                           ((uint32_t)0x00000002)
#define SDIO_IT_CMDD                         ((uint32_t)0x00000004)
#define SDIO_IT_DTO                          ((uint32_t)0x00000008)
#define SDIO_IT_TXDR                         ((uint32_t)0x00000010)
#define SDIO_IT_RXDR                         ((uint32_t)0x00000020)
#define SDIO_IT_RCRC                         ((uint32_t)0x00000040)
#define SDIO_IT_DCRC                         ((uint32_t)0x00000080)
#define SDIO_IT_RTO                          ((uint32_t)0x00000100)
#define SDIO_IT_DRTO                         ((uint32_t)0x00000200)
#define SDIO_IT_HTO                          ((uint32_t)0x00000400)
#define SDIO_IT_FRUN                         ((uint32_t)0x00000800)
#define SDIO_IT_HLE                          ((uint32_t)0x00001000)
#define SDIO_IT_SBE                          ((uint32_t)0x00002000)
#define SDIO_IT_ACD                          ((uint32_t)0x00004000)
#define SDIO_IT_EBE                          ((uint32_t)0x00008000)
#define SDIO_IT_FROM_CARD                    ((uint32_t)0x00010000)
/**
  * @}
  */

/** @defgroup SDIO_Exported_Macros SDIO Exported Macros
  * @{
  */
  
/**
  * @brief  Enable CMD pullup.
  * @retval None
  */    
#define __SDIO_OD_PULLUP_ENABLE()    SET_BIT(SDIO->CTRL, SDIO_CTRL_ODPUEN)
  
/**
  * @brief  Disable CMD pullup.
  * @retval None
  */    
#define __SDIO_OD_PULLUP_DISABLE()    CLEAR_BIT(SDIO->CTRL, SDIO_CTRL_ODPUEN)
  
/**
  * @brief  Enables the SDIO card to suspend queues.
  * @retval None
  */    
#define __SDIO_PEND_QUEUSE()         SET_BIT(SDIO->CTRL, SDIO_CTRL_ABORTRD)

/**
  * @brief  Send automatic IRQ response.
  * @retval None
  */    
#define __SDIO_SEND_IRQ()            SET_BIT(SDIO->CTRL, SDIO_CTRL_AUTOIRQRESP)

/**
  * @brief  Send read wait to SDIO card
  * @retval None
  */    
#define __SDIO_SEND_READ_WAIT()      SET_BIT(SDIO->CTRL, SDIO_CTRL_READWAIT)

/**
  * @brief  Reset FIFO
  * @retval None
  */    
#define __SDIO_FIFO_RESET()      SET_BIT(SDIO->CTRL, SDIO_CTRL_FIFORST)

/**
  * @brief  Reset SDIO controller
  * @retval None
  */    
#define __SDIO_CONTR_RESET()      SET_BIT(SDIO->CTRL, SDIO_CTRL_SDIORST)

/**
  * @brief  Send CCSD to CE-ATA.
  * @retval None
  */    
#define __SDIO_CEATA_SEND_CCSD()    SET_BIT(SDIO->CTRL, SDIO_CTRL_CCSDEN)
  
/**
  * @brief  Automatically send STOP after sending CCSD to CE-ATA.
  * @retval None
  */    
#define __SDIO_CEATA_SEND_STOP()    SET_BIT(SDIO->CTRL, SDIO_CTRL_AUTOSTOPCCSD)

/**
  * @brief  Enable the CE-ATA device interrupt.
  * @retval None
  */    
#define __SDIO_CEATA_DEVICE_ENABLE_IT()    SET_BIT(SDIO->CTRL, SDIO_CTRL_CEATAINTEN)

/**
  * @brief  Disable the CE-ATA device interrupt.
  * @retval None
  */  
#define __SDIO_CEATA_DEVICE_DISABLE_IT()   CLEAR_BIT(SDIO->CTRL, SDIO_CTRL_CEATAINTEN)

/**
  * @brief  Enable the CE-ATA interrupt.
  * @retval None
  */    
#define __SDIO_CEATA_ENABLE_IT()    SET_BIT(SDIO->CMD, SDIO_CMD_IEN)

/**
  * @brief  Disable the CE-ATA interrupt.
  * @retval None
  */  
#define __SDIO_CEATA_DISABLE_IT()   CLEAR_BIT(SDIO->CMD, SDIO_CMD_IEN)

/**
  * @brief  Enable send CE-ATA command (CMD61).
  * @retval None
  */  
#define __SDIO_CEATA_SENDCMD_ENABLE()   SET_BIT(SDIO->CMD, SDIO_CMD_STARTCMD)

/**
  * @brief  Disable send CE-ATA command (CMD61).
  * @retval None
  */  
#define __SDIO_CEATA_SENDCMD_DISABLE()   CLEAR_BIT(SDIO->CMD, SDIO_CMD_STARTCMD)

/**
  * @brief  Force start operation.
  * @retval None
  */  
#define __SDIO_EMMC_BOOT_MODE_FORCE()   SET_BIT(SDIO->CMD, SDIO_CMD_BOOTMODE)

/**
  * @brief  Backup startup operation.
  * @retval None
  */  
#define __SDIO_EMMC_BOOT_MODE_BACKUP()   CLEAR_BIT(SDIO->CMD, SDIO_CMD_BOOTMODE)

/**
  * @brief  Enable boot startup.
  * @retval None
  */  
#define __SDIO_EMMC_BOOT_ENABLE()   MODIFY_REG(SDIO->CMD, (SDIO_CMD_BOOTEN| SDIO_CMD_BOOTDIS), \
                                                          (SDIO_CMD_BOOTEN| ~SDIO_CMD_BOOTDIS))

/**
  * @brief  Disable boot startup.
  * @retval None
  */  
#define __SDIO_EMMC_BOOT_DISABLE()   MODIFY_REG(SDIO->CMD, (SDIO_CMD_BOOTEN| SDIO_CMD_BOOTDIS), \
                                                           (~SDIO_CMD_BOOTEN| SDIO_CMD_BOOTDIS))

/**
  * @brief  Reset boot startup.
  * @retval None
  */  
#define __SDIO_EMMC_BOOT_RESET()   CLEAR_BIT(SDIO->CMD,(SDIO_CMD_BOOTEN| SDIO_CMD_BOOTDIS))

/**
  * @brief  Expect boot ack ensable.
  * @retval None
  */  
#define __SDIO_EMMC_BOOT_ACK_ENABLE()   SET_BIT(SDIO->CMD, SDIO_CMD_BOOTMODE)

/**
  * @brief  Expect boot ack disable.
  * @retval None
  */  
#define __SDIO_EMMC_BOOT_ACK_DISABLE()   CLEAR_BIT(SDIO->CMD, SDIO_CMD_BOOTMODE)
/**
  * @}
  */
/* Exported functions --------------------------------------------------------*/
/** @addtogroup SDIO_Exported_Functions
  * @{
  */

