OpenPuya/IAP_APP_Fireware/PY32F4xx_IAP_APP_Firmware/Drivers/PY32F4xx_HAL_Driver/Inc/py32f4xx_ll_sdio.h
/*  Function used to set the SDIO configuration to the default reset state ****/
void SDIO_DeInit(void);
void SDIO_Init(SDIO_TypeDef *SDIOx, SDIO_InitTypeDef* SDIO_InitStruct);
void SDIO_StructInit(SDIO_InitTypeDef* SDIO_InitStruct);
void SDIO_ClockCmd(SDIO_TypeDef *SDIOx,FunctionalState NewState);
void SDIO_SetClock(SDIO_TypeDef *SDIOx,uint32_t SDIO_ClkDiv);
void SDIO_SetCardBusWidth(SDIO_TypeDef *SDIOx,uint32_t SDIO_Width);
void SDIO_SetPowerState(SDIO_TypeDef *SDIOx,uint32_t SDIO_PowerState);
uint32_t SDIO_GetPowerState(SDIO_TypeDef *SDIOx);

void SDIO_IsAutoStopCmd(SDIO_TypeDef *SDIOx,FunctionalState NewState);
/* Command path state machine (CPSM) management functions *********************/
void SDIO_SendCommand(SDIO_TypeDef *SDIOx,SDIO_CmdInitTypeDef *SDIO_CmdInitStruct);
void SDIO_CmdStructInit(SDIO_CmdInitTypeDef* SDIO_CmdInitStruct);
uint32_t SDIO_GetResponse(SDIO_TypeDef *SDIOx,uint32_t SDIO_RESP);

/* Data path state machine (DPSM) management functions ************************/
void SDIO_DataConfig(SDIO_TypeDef *SDIOx,SDIO_DataInitTypeDef* SDIO_DataInitStruct);
void SDIO_DataStructInit(SDIO_DataInitTypeDef* SDIO_DataInitStruct);

/* FIFO Threshold management functions ************************/
void SDIO_SetTxWaterMark(SDIO_TypeDef *SDIOx,uint16_t SDIO_WaterMark);
void SDIO_SetRxWaterMark(SDIO_TypeDef *SDIOx,uint16_t SDIO_WaterMark);
uint16_t SDIO_GetFifoCount(SDIO_TypeDef *SDIOx);
uint32_t SDIO_IsFifoEmpty(SDIO_TypeDef *SDIOx);
uint32_t SDIO_IsFifoFull(SDIO_TypeDef *SDIOx);
uint32_t SDIO_ReadData(SDIO_TypeDef * SDIOx);
void SDIO_WriteData(SDIO_TypeDef * SDIOx,uint32_t Data);

/* Status management functions ************************/
uint32_t SDIO_GetFIFOCount(SDIO_TypeDef * SDIOx);
uint16_t SDIO_GetCmdState(SDIO_TypeDef *SDIOx);
uint32_t SDIO_IsCardBusy(SDIO_TypeDef *SDIOx);
uint8_t SDIO_GetRspIdx(SDIO_TypeDef *SDIOx);

/* DMA transfers management functions *****************************************/
void SDIO_DMACmd(SDIO_TypeDef * SDIOx,FunctionalState NewState);

/* Interrupts and flags management functions **********************************/
void SDIO_ITCmd(SDIO_TypeDef * SDIOx,FunctionalState NewState);
void SDIO_ITConfig(SDIO_TypeDef * SDIOx,uint32_t SDIO_IT, FunctionalState NewState);
ITStatus SDIO_GetITStatus(SDIO_TypeDef * SDIOx,uint32_t SDIO_IT);
void SDIO_ClearITStatus(SDIO_TypeDef * SDIOx,uint32_t SDIO_IT);

/* Private functions -----------------------------------------------------------*/


/**
  * @}
  */
  
/** @addtogroup SDIO_Private_Macros
  * @{
  */
#define IS_SDIO_BUS_WIDE(WIDE)              (((WIDE) == SDIO_BUS_WIDE_1B) || \
                                             ((WIDE) == SDIO_BUS_WIDE_4B) || \
                                             ((WIDE) == SDIO_BUS_WIDE_8B))

#define IS_SDIO_CLOCK_POWER_SAVE(SAVE)      (((SAVE) == SDIO_CLOCK_POWER_SAVE_DISABLE) || \
                                             ((SAVE) == SDIO_CLOCK_POWER_SAVE_ENABLE ))

#define IS_SDIO_SMP_CLOCK(CLOCK)            (((CLOCK) == SDIO_SMP_CLOCK_SDCLK_OFFSET270) || \
                                             ((CLOCK) == SDIO_SMP_CLOCK_SDCLK_DEFAULT  ))

#define IS_SDIO_SMP_STATE(STATE)            (((STATE) == SDIO_SMP_DISABLE) || \
                                             ((STATE) == SDIO_SMP_ENABLE ))
                                            
#define IS_SDIO_CLOCK_Output(CLOCK)         (((CLOCK) == SDIO_CLOCK_OUTPUT_OFFSET90 ) || \
                                             ((CLOCK) == SDIO_CLOCK_OUTPUT_OFFSET180))

#define IS_SDIO_RESPONSE_TYPE(TYPE)         (((TYPE) == SDIO_RESPONSE_NO   ) || \
                                             ((TYPE) == SDIO_RESPONSE_SHORT) || \
                                             ((TYPE) == SDIO_RESPONSE_LONG ))

#define IS_SDIO_WAIT_INTERRUPT_STATE(STATE) (((STATE) == SDIO_WAIT_NO  ) || \
                                             ((STATE) == SDIO_WAIT_PEND))

#define IS_SDIO_INITSIGNAL(STATE)          (((STATE) == SDIO_INITSIGNAL_DISABLE) || \
                                            ((STATE) == SDIO_INITSIGNAL_ENABLE ))

#define IS_SDIO_RESPONSE_CRC(STATE)        (((STATE) == SDIO_RESPONSE_CRC_DISABLE) || \
                                            ((STATE) == SDIO_RESPONSE_CRC_ENABLE ))

#define IS_SDIO_DATATRANSFER(STATE)        (((STATE) == SDIO_DATATRANSFER_DISABLE) || \
                                            ((STATE) == SDIO_DATATRANSFER_ENABLE ))

#define SDIO_CPSM_STATE(STATE)             (((STATE) == SDIO_CPSM_DISABLE) || \
                                            ((STATE) == SDIO_CPSM_ENABLE ))

#define SDIO_DATA_BLOCK_SIZE(SIZE)         (((SIZE) == SDIO_DATABLOCKSIZE_1B    ) || \
                                            ((SIZE) == SDIO_DATABLOCKSIZE_2B    ) || \
                                            ((SIZE) == SDIO_DATABLOCKSIZE_4B    ) || \
                                            ((SIZE) == SDIO_DATABLOCKSIZE_8B    ) || \
                                            ((SIZE) == SDIO_DATABLOCKSIZE_16B   ) || \
                                            ((SIZE) == SDIO_DATABLOCKSIZE_32B   ) || \
                                            ((SIZE) == SDIO_DATABLOCKSIZE_64B   ) || \
                                            ((SIZE) == SDIO_DATABLOCKSIZE_128B  ) || \
                                            ((SIZE) == SDIO_DATABLOCKSIZE_256B  ) || \
                                            ((SIZE) == SDIO_DATABLOCKSIZE_512B  ) || \
                                            ((SIZE) == SDIO_DATABLOCKSIZE_1024B ) || \
                                            ((SIZE) == SDIO_DATABLOCKSIZE_2048B ) || \
                                            ((SIZE) == SDIO_DATABLOCKSIZE_4096B ) || \
                                            ((SIZE) == SDIO_DATABLOCKSIZE_8192B ) || \
                                            ((SIZE) == SDIO_DATABLOCKSIZE_16384B))

#define SDIO_TRANSFER_DIRECTION(DIR)       (((DIR) == SDIO_TRANSFERDIR_TO_HOST) || \
                                            ((DIR) == SDIO_TRANSFERDIR_TO_CARD))

#define SDIO_TRANSFER_TYPE(TYPE)           (((TYPE) == SDIO_TRANSFERMODE_BLOCK ) || \
                                            ((TYPE) == SDIO_TRANSFERMODE_STREAM))

/**
  * @}
  */
  
/**
  * @}
  */

/**
  * @}
  */
  
/**
  * @}
  */
#ifdef __cplusplus
}
#endif

#endif /* __PY32F4XX_LL_SDIO_H */

/************************ (C) COPYRIGHT Puya *****END OF FILE******************/
